ATsupportum/src/Documents/УказаниеОбъектовАренды_ат/УказаниеОбъектовАренды_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УказаниеОбъектовАренды_ат</name>
  <registerRecords>InformationRegister.ДоступностьАренды_ат</registerRecords>
  <attributes>
    <name>ОбъектАренды</name>
    <type>
      <types>CatalogRef.ОбъектыАренды_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаблокироватьАренду</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПередачиВАренду</name>
    <type>
      <types>EnumRef.ТипыПередачиВАренду_ат</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Серверы</name>
    <attributes>
      <name>Сервер</name>
      <type>
        <types>CatalogRef.Серверы_ат</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РолиСерверов</name>
    <attributes>
      <name>РольСервера</name>
      <type>
        <types>CatalogRef.РолиСерверов_ат</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоставкиПродуктов</name>
    <attributes>
      <name>ПоставкаПродукта</name>
      <type>
        <types>CatalogRef.ПоставкиПродуктов_ат</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОграниченныйСписокКлиентов</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Контрагенты_ат</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ATsupportum/src/Enums/ТипыПередачиВАренду_ат/ТипыПередачиВАренду_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПередачиВАренду_ат</name>
  <enumValues>
    <name>ВыделениеСервера</name>
  </enumValues>
  <enumValues>
    <name>ДоступКРолиСервера</name>
  </enumValues>
  <enumValues>
    <name>СозданиеЭкземпляраПродукта</name>
  </enumValues>
</mdclass:Enum>

ATsupportum/src/Documents/УказаниеОбъектовАренды_ат/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправляемыеФормы_Сервер_ат.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	ПересчитатьЗаголовкиСтраниц();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправляемыеФормы_Клиент_ат.ПриОткрытии(ЭтаФорма, Отказ);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиДействийПользователя

&НаКлиенте
Процедура ТипПередачиВАрендуПриИзменении(Элемент)
	
	ПересчитатьЗаголовкиСтраниц();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
	
	
	
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПересчитатьЗаголовкиСтраниц()
	
	Если НЕ ЗначениеЗаполнено(Объект.ТипПередачиВАренду) Тогда
		
		Элементы.СтраницаСерверы.Заголовок = "Серверы";
		Элементы.СтраницаРолиСерверов.Заголовок = "Роли серверов";
		Элементы.СтраницаПоставкиПродуктов.Заголовок = "Поставки продуктов";

	Иначе 	
	
		Элементы.СтраницаСерверы.Заголовок =
			?(Объект.ТипПередачиВАренду = Перечисления.ТипыПередачиВАренду_ат.ВыделениеСервера,
				"Выбранные серверы", "Отбор по серверам");
		Элементы.СтраницаРолиСерверов.Заголовок =
			?(Объект.ТипПередачиВАренду = Перечисления.ТипыПередачиВАренду_ат.ДоступКРолиСервера,
				"Выбранные роли серверов", "Отбор по ролям серверов");
		Элементы.СтраницаПоставкиПродуктов.Заголовок =
			?(Объект.ТипПередачиВАренду = Перечисления.ТипыПередачиВАренду_ат.СозданиеЭкземпляраПродукта,
				"Выбранные поставки продуктов", "Отбор по поставкам продуктов");
			
	КонецЕсли;		
			
КонецПроцедуры 	
	
#КонецОбласти

#Область УниверсальныеОбработчикиДействий
	
&НаКлиенте
Процедура ОбработчикУниверсальныхДействий(Команда)
	
	УправляемыеФормы_Клиент_ат.ДополнительныеДействияФормы(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаСервере
Функция   ОбработчикУниверсальныхДействий_Сервер(Элемент) Экспорт
	
	Возврат УправляемыеФормы_Сервер_ат.ДополнительныеДействияФормы(ЭтаФорма, Команды[Элемент.Имя]);
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	УправляемыеФормы_Клиент_ат.ПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УправляемыеФормы_Клиент_ат.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти
